docs/mathematics/linear_algebra/KBrefNormalOperators.tex
% Created 2021-09-12 Sun 22:49
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Normal Operators}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Normal Operators},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler7.18 normal\hfill{}\textsc{def}}
\label{sec:orgb3ed46e}
Not to be confused with \href{KBrefNormal.org}{normal vectors}, which have \href{KBrefNorm.org}{norm} 1.
\begin{quote}
\begin{itemize}
\item An operator on an inner product space is called \emph{normal} if it commutes with its adjoint.
\item aka: \(T \in  \mathcal{L}(V)\) is \emph{normal} if
\end{itemize}
\[\begin{aligned}
  TT^* = T^*T
  \end{aligned}\]
\end{quote}
Every \href{KBrefSelfAdjointOperators.org}{self adjoint} operator is normal, because \(TT = TT\)
\section{results}
\label{sec:org5f4c507}
\subsection{Axler7.20 \(T\) is normal iff \(\lVert Tv \rVert = \lVert T^* v \rVert\) for all \(v\)}
\label{sec:orga636d36}
This implies that \(\onull T = \onull T^*\) for all normal operators \(T\)..
\subsection{Axler7.21 For \(T\) normal, \(T\) and \(T^*\) have the same eigenvectors}
\label{sec:org5db13d0}
\begin{quote}
And the corresponding eigenvalues are conjugates of one another.
\end{quote}
\subsection{Axler7.22 Normal operators have orthogonal eigenvectors}
\label{sec:orgf582cec}
\begin{quote}
Suppose \(T \in  \mathcal{L}(V)\) is normal. Then eigenvectors of \(T\) corresponding to disticnct eigenvalues are orthogonal.
\end{quote}
\end{document}
